Importing needed Packages

In [2]:
import pandas as pd
import numpy as np
import matplotlib

Creating dataframes for each sheet by reading the excel file -'V02Max_Combined'

In [15]:
file_path='Hackathon_Aug24/V02Max_Combined.xlsx'
Kayaking=pd.read_excel(file_path,sheet_name='Kayaking')
Athletes=pd.read_excel(file_path,sheet_name='Athletes')
Traithlon=pd.read_excel(file_path,sheet_name='Triathlon')
Fencing=pd.read_excel(file_path,sheet_name='Fencing')

C:\Users\Sailu\anaconda3\Lib\site-packages\openpyxl\worksheet\_read_only.py:81: UserWarning: Unknown extension is not supported and will be removed
  for idx, row in parser.parse():
C:\Users\Sailu\anaconda3\Lib\site-packages\openpyxl\worksheet\_read_only.py:81: UserWarning: Unknown extension is not supported and will be removed
  for idx, row in parser.parse():
C:\Users\Sailu\anaconda3\Lib\site-packages\openpyxl\worksheet\_read_only.py:81: UserWarning: Unknown extension is not supported and will be removed
  for idx, row in parser.parse():

In [18]:
print(Kayaking)

       ID      time     RR       VO2  power
0      11  -168.600  727.0  0.287147      0
1      11  -167.872  728.0  0.287147      0
2      11  -167.148  724.0  0.287147      0
3      11  -166.484  664.0  0.320580      0
4      11  -165.836  648.0  0.320580      0
...    ..       ...    ...       ...    ...
19473  16  1118.404  548.0  0.671957      0
19474  16  1118.944  540.0  0.671957      0
19475  16  1119.484  540.0  0.671957      0
19476  16  1120.016  532.0  0.671957      0
19477  16  1120.544  528.0  0.671957      0

[19478 rows x 5 columns]

Creating a column called 'Sport' into the dataframes

In [27]:
Kayaking['sport']='Kayaking'
Fencing['sport']='Fencing'
Traithlon['sport']='Triathlon'

print(sport)

Concatenating all the dataframes (all the sheets into one)

In [37]:
All_sports=pd.concat([Kayaking,Fencing,Traithlon],ignore_index=True)

In [39]:
All_sports.head()

   ID     time     RR       VO2  power     sport
0  11 -168.600  727.0  0.287147      0  Kayaking
1  11 -167.872  728.0  0.287147      0  Kayaking
2  11 -167.148  724.0  0.287147      0  Kayaking
3  11 -166.484  664.0  0.320580      0  Kayaking
4  11 -165.836  648.0  0.320580      0  Kayaking

In [41]:
All_sports.tail()

       ID     time     RR       VO2  power      sport
52057  18  947.288  536.0  0.507071      0  Triathlon
52058  18  947.816  528.0  0.507071      0  Triathlon
52059  18  948.344  528.0  0.507071      0  Triathlon
52060  18  948.884  540.0  0.507071      0  Triathlon
52061  18  949.424  540.0  0.507071      0  Triathlon

In [53]:
All_sports.set_index(['sport'],inplace=True)

In [126]:
All_sports.head()

          ID     time     RR       VO2  power
sport
Kayaking  11 -168.600  727.0  0.287147      0
Kayaking  11 -167.872  728.0  0.287147      0
Kayaking  11 -167.148  724.0  0.287147      0
Kayaking  11 -166.484  664.0  0.320580      0
Kayaking  11 -165.836  648.0  0.320580      0

Q17 ) What is the maximum ventilatory threshold for triathletes.

In [113]:
#Athletes.describe()
Triathletes=Athletes[(Athletes['sport']=='triathlon')]
Triathletes

,ID,age,Weight,Height,P_vt1,P_vt2,sport,Gender,Ethnicity,First Name,Last Name
16,17,12,39.9,156,101,145,triathlon,Male,Latino,Lucas,Foster
17,18,12,39.7,158,65,168,triathlon,Male,Latino,Owen,Myers

In [188]:
Max_Ventilatory_threshold=Triathletes[['P_vt1','P_vt2']].describe()
Max_Ventilatory_threshold.loc['max']

P_vt1    101.0
P_vt2    168.0
Name: max, dtype: float64

Q18)Display the number of athletes in every sport against the name of the sport.

In [147]:
Athletes['sport'].value_counts()

sport
fencing      10
kayak         6
triathlon     2
Name: count, dtype: int64

Q23)Using any 10 HR values print even if the value is an even number and odd if its an odd number

In [184]:
All_sports['HR']=round(60000/All_sports['RR'])
HR_random=All_sports['HR'].tail(50)
HR_random=HR_random.drop_duplicates()
HR_random=HR_random.head(10)
for i in HR_random:
    if i%2==0:
        print("HR ",i," is an even number")
    else:
        print("HR ",i," is an odd number")

HR  110.0  is an even number
HR  109.0  is an odd number
HR  115.0  is an odd number
HR  112.0  is an even number
HR  114.0  is an even number
HR  116.0  is an even number
HR  118.0  is an even number
HR  117.0  is an odd number
HR  111.0  is an odd number
HR  119.0  is an odd number

Q25)Store athlete name and sport in a dictionary as a pair of values.

In [197]:
Name_sport_dict=Athletes.set_index('First Name')['sport'].to_dict()
Name_sport_dict

{'Olivia': 'fencing',
 'Ethan': 'fencing',
 'Jackson': 'fencing',
 'Liam': 'fencing',
 'Ava': 'fencing',
 'Sophia': 'fencing',
 'Grace': 'fencing',
 'Aiden': 'fencing',
 'Chloe': 'fencing',
 'Lily': 'fencing',
 'Isabella': 'kayak',
 'Caleb': 'kayak',
 'Mia': 'kayak',
 'Harper': 'kayak',
 'Mason': 'kayak',
 'Logan': 'kayak',
 'Lucas': 'triathlon',
 'Owen': 'triathlon'}